Terraform Plan:

```
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_application_insights.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_application_insights.SSPHP will be destroyed
  # (because azurerm_application_insights.SSPHP is not in configuration)
  - resource "azurerm_application_insights" "SSPHP" {
      - app_id                                = "042c0014-747c-4927-be3b-74cbf748f850" -> null
      - application_type                      = "other" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "westeurope" -> null
      - name                                  = "SSPHP-Metrics" -> null
      - resource_group_name                   = "s194d00-SSPHP-Metrics" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "Environment"      = "Dev"
          - "Product"          = "Protective Monitoring - Splunk SaaS"
          - "Service Offering" = "Protective Monitoring - Splunk SaaS"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
            # (6 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
        tags                                           = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241209123633.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.data_ingester.azurerm_storage_container.tfstate,
  on ../data_ingester/module.tf line 36, in resource "azurerm_storage_container" "tfstate":
  36:   storage_account_name  = azurerm_storage_account.tfstate.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
stdout<<ghadelimiter_27904ed4-b92a-4768-a414-7d3e15a2bd3e
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_application_insights.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_application_insights.SSPHP will be destroyed
  # (because azurerm_application_insights.SSPHP is not in configuration)
  - resource "azurerm_application_insights" "SSPHP" {
      - app_id                                = "042c0014-747c-4927-be3b-74cbf748f850" -> null
      - application_type                      = "other" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "westeurope" -> null
      - name                                  = "SSPHP-Metrics" -> null
      - resource_group_name                   = "s194d00-SSPHP-Metrics" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "Environment"      = "Dev"
          - "Product"          = "Protective Monitoring - Splunk SaaS"
          - "Service Offering" = "Protective Monitoring - Splunk SaaS"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
            # (6 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
        tags                                           = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241209123633.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.data_ingester.azurerm_storage_container.tfstate,
  on ../data_ingester/module.tf line 36, in resource "azurerm_storage_container" "tfstate":
  36:   storage_account_name  = azurerm_storage_account.tfstate.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_27904ed4-b92a-4768-a414-7d3e15a2bd3e
stderr<<ghadelimiter_43752795-a6e8-49bf-ae6f-39760eac805d

ghadelimiter_43752795-a6e8-49bf-ae6f-39760eac805d
exitcode<<ghadelimiter_ea534273-0082-4a12-b6dc-4d5776d0960f
0
ghadelimiter_ea534273-0082-4a12-b6dc-4d5776d0960f
```